In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.2.0-cp39-cp39-macosx_10_9_x86_64.whl (12.5 MB)
     |████████████████████████████████| 12.5 MB 4.1 MB/s eta 0:00:01
Collecting pytz>=2020.1
  Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
     |████████████████████████████████| 505 kB 4.5 MB/s eta 0:00:01
Collecting tzdata>=2022.7
  Downloading tzdata-2023.4-py2.py3-none-any.whl (346 kB)
     |████████████████████████████████| 346 kB 15.1 MB/s eta 0:00:01
Requirement already satisfied: python-dateutil>=2.8.2 in ./venv/lib/python3.9/site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy<2,>=1.22.4 in ./venv/lib/python3.9/site-packages (from pandas) (1.26.3)
Requirement already satisfied: six>=1.5 in ./venv/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Installing collected packages: tzdata, pytz, pandas
Successfully installed pandas-2.2.0 pytz-2024.1 tzdata-2023.4
WARNING: You are using pip version 21.1.3; however, version 24.0 is available.
You should consider upgrading via the '/Users/admin/Desktop/Ml/venv/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [3]:
pip install Pyarrow

Collecting Pyarrow
  Downloading pyarrow-15.0.0-cp39-cp39-macosx_10_15_x86_64.whl (27.1 MB)
     |████████████████████████████████| 27.1 MB 113 kB/s eta 0:00:01     |████████████▊                   | 10.8 MB 4.1 MB/s eta 0:00:05
Requirement already satisfied: numpy<2,>=1.16.6 in ./venv/lib/python3.9/site-packages (from Pyarrow) (1.26.3)
Installing collected packages: Pyarrow
Successfully installed Pyarrow-15.0.0
WARNING: You are using pip version 21.1.3; however, version 24.0 is available.
You should consider upgrading via the '/Users/admin/Desktop/Ml/venv/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [5]:
import pandas as pd

In [6]:
pd.__version__

'2.2.0'

In [7]:
l1 = [1,2,3,-3,6.2,'data values']
print(l1)

[1, 2, 3, -3, 6.2, 'data values']

In [10]:
s1 = pd.Series(l1)

In [11]:
s1

0              1
1              2
2              3
3             -3
4            6.2
5    data values
dtype: object

In [12]:
type(s1)

pandas.core.series.Series

In [13]:
s2 = pd.Series([1,2,3,4])

In [14]:
s2

0    1
1    2
2    3
3    4
dtype: int64

In [15]:
empty = pd.Series([])

In [16]:
empty

Series([], dtype: object)

In [17]:
s3 = pd.Series([1,2,3,4], index = ['a','b','c','d'])

In [18]:
s3

a    1
b    2
c    3
d    4
dtype: int64

In [19]:
s3 = pd.Series([1,2,3,4], index = ['a','b','c','d'], dtype = float)

In [20]:
s3

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [21]:
s3 = pd.Series([1,2,3,4], index = ['a','b','c','d'], dtype = float, name = 'data values')

In [22]:
s3

a    1.0
b    2.0
c    3.0
d    4.0
Name: data values, dtype: float64

In [23]:
#scaler values

In [24]:
sc1 = pd.Series(0.5)

In [25]:
sc1

0    0.5
dtype: float64

In [26]:
sc1 = pd.Series(0.5, index = [1,2,3])
sc1

1    0.5
2    0.5
3    0.5
dtype: float64

In [27]:
dc1 = pd.Series({'a':1,'b':2})
dc1

a    1
b    2
dtype: int64

In [29]:
s4 = pd.Series([1,2,3,4,5])
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [30]:
s4[0]  
s4[3]

4

In [31]:
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [32]:
max(s4)

5

In [33]:
min(s4)

1

In [34]:
s4[s4 > 3]

3    4
4    5
dtype: int64

In [35]:
s4

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [36]:
s5 = pd.Series([1,2,3,4,5])

In [37]:
s5

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [38]:
s4+s5

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [39]:
s6 = pd.Series([1,2,3])

In [40]:
s5+s6

0    2.0
1    4.0
2    6.0
3    NaN
4    NaN
dtype: float64

In [41]:
# Dataframe

In [43]:
em_df = pd.DataFrame()
em_df

Empty DataFrame
Columns: []
Index: []

In [44]:
em_df

Empty DataFrame
Columns: []
Index: []

In [45]:
lst = ['a', 'b','c']
lst

['a', 'b', 'c']

In [46]:
df1 = pd.DataFrame(lst)
df1

   0
0  a
1  b
2  c

In [47]:
ls_of_ld = [[1,2,3],[2,3,4], [4,5,6]]
ls_of_ld

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [49]:
df2 = pd.DataFrame(ls_of_ld)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [50]:
dict1 = {'ID': [11,12,13]}
dict1

{'ID': [11, 12, 13]}

In [51]:
df3 = pd.DataFrame(dict1)
df3

   ID
0  11
1  12
2  13

In [52]:
dict2 = {'ID': [11,12,13], 'SN':[1,2,3]}
dict2

{'ID': [11, 12, 13], 'SN': [1, 2, 3]}

In [54]:
df3 = pd.DataFrame(dict2)
df3

   ID  SN
0  11   1
1  12   2
2  13   3

In [55]:
ls_dict = [{'a':1,'b':2}, {'a':3,'b':4}]
ls_dict

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4}]

In [56]:
df5 = pd.DataFrame(ls_dict)
df5

   a  b
0  1  2
1  3  4

In [57]:
ls_dict1 = [{'a':1,'b':2}, {'a':3,'b':4,'c':5}]
ls_dict1

[{'a': 1, 'b': 2}, {'a': 3, 'b': 4, 'c': 5}]

In [58]:
df6 = pd.DataFrame(ls_dict1)
df6

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [64]:
dict_sr = {'Id':pd.Series([1,2,3]), 'SN':pd.Series([11,22,111])}
dict_sr

{'Id': 0    1
 1    2
 2    3
 dtype: int64,
 'SN': 0     11
 1     22
 2    111
 dtype: int64}

In [66]:
df7 = pd.DataFrame(dict_sr)
df7

   Id   SN
0   1   11
1   2   22
2   3  111

In [67]:
#csv

In [76]:
pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv')

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [77]:
import os

In [79]:
print(os.getcwd()) #current working directory

/Users/admin/Desktop/Ml

In [80]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv')

In [81]:
df

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [82]:
type(df)

pandas.core.frame.DataFrame

In [83]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [84]:
df1  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', nrows = 1)
df1

   a   b   c   d
0  1  45  78  35

In [85]:
df2  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', usecols = [0]) #0 index
df2

   a
0  1
1  2
2  3
3  4
4  5

In [86]:
df2  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', usecols = [0,1]) #0 index
df2

   a   b
0  1  45
1  2  79
2  3  90
3  4  65
4  5  89

In [87]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', skiprows = 1)

In [88]:
df

   1  45  78  35
0  2  79  36  29
1  3  90  78  35
2  4  65   9  56
3  5  89  75  37

In [89]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', skiprows = [0])

In [90]:
df

   1  45  78  35
0  2  79  36  29
1  3  90  78  35
2  4  65   9  56
3  5  89  75  37

In [93]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', index_col = 'a')
df

    b   c   d
a
1  45  78  35
2  79  36  29
3  90  78  35
4  65   9  56
5  89  75  37

In [94]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', header = 1)
df

   1  45  78  35
0  2  79  36  29
1  3  90  78  35
2  4  65   9  56
3  5  89  75  37

In [95]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', header = None)
df

   0   1   2   3
0  a   b   c   d
1  1  45  78  35
2  2  79  36  29
3  3  90  78  35
4  4  65   9  56
5  5  89  75  37

In [101]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', header = None, prefix = 'Col') #header is must for prefix
df

TypeError: read_csv() got an unexpected keyword argument 'prefix'

In [102]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', names = ['aa', 'BB','cc','dd']) #header is must for prefix
df

  aa  BB  cc  dd
0  a   b   c   d
1  1  45  78  35
2  2  79  36  29
3  3  90  78  35
4  4  65   9  56
5  5  89  75  37

In [103]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv')
df

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [104]:
df.head() #top 5 rows

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [106]:
df.head(1) #top 1 rows

   a   b   c   d
0  1  45  78  35

In [109]:
df.head(3) #top 3 rows

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35

In [110]:
df.tail(3) #bottom 3 rows

   a   b   c   d
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [111]:
df.tail()

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [112]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', dtype = {'a':'float64'} )
df

     a   b   c   d
0  1.0  45  78  35
1  2.0  79  36  29
2  3.0  90  78  35
3  4.0  65   9  56
4  5.0  89  75  37

In [117]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', true_values=['a'], false_values=['b'])
df

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [118]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv')
df

   a   b   c   d
0  1  45  78  35
1  2  79  36  29
2  3  90  78  35
3  4  65   9  56
4  5  89  75  37

In [124]:
df  = pd.read_csv('/Users/admin/Desktop/Ml/test_ml - Sheet1.csv', na_values= 2)
df

     a   b   c   d
0  1.0  45  78  35
1  NaN  79  36  29
2  3.0  90  78  35
3  4.0  65   9  56
4  5.0  89  75  37